[
  {
    "title": "Engineering Intern",
    "company": "Commvault Systems",
    "from": "May 2024",
    "to": "Jan 2025",
    "location": "Tinton Falls, New Jersey",
    "summary": "Engineered a scalable AI-powered log analysis tool using Vertex AI and Python to diagnose job failures and improve cloud-based solutions. Built a PCA-based Threat Detection system in Azure ML Studio and Synapse Analytics to monitor 10,000+ daily delete transactions, optimizing query performance and automating pipelines. Created a security tool using Bash and PowerShell scripts to identify over 400 exposed credentials across multiple machines.",
    "skills": [
      "Java",
      "Python",
      "Azure Machine Learning",
      "Cloud Security",
      "C++",
      "DevOps"
    ],
    "jobDescription": [
      "Engineered a scalable AI-powered log analysis tool using Vertex AI and Python to diagnose job failures, processing 300+ requests daily to enhance cloud solution reliability.",
      "Built a PCA-based Threat Detection system in Azure ML Studio and Synapse Analytics to monitor 10,000+ daily delete transactions in Azure Storage, optimizing query performance with KQL.",
      "Automated the identification of exposed credentials using Bash and PowerShell scripts on Linux environments, scanning databases and logs across multiple machines to uncover over 400 instances of exposed credentials."
    ]
  },
  {
    "title": "Software Development Engineer In Test",
    "company": "Commvault Systems",
    "from": "Jan 2021",
    "to": "Jul 2023",
    "location": "Bengaluru, India",
    "summary": "Developed and optimized Selenium and Java automation frameworks to improve software reliability and reduce regression testing time by 40%. Automated Azure and AWS auto-scaling verifications. Built AutoCenter, a test management application, and implemented Infrastructure as Code (IaC) to streamline cloud resource management and reduce manual intervention by 60%. Resolved critical issues as a Subject Matter Expert (SME) for Microsoft Hyper-V and Azure solutions.",
    "skills": [
      "Java",
      "Python",
      "Selenium",
      "JUnit",
      "JMeter",
      "Azure",
      "Terraform",
      "Ansible",
      "DevOps"
    ],
    "jobDescription": [
      "Developed and optimized Selenium and Java automation frameworks, improving the Virtual Server Agent (VSA) reliability and reducing regression testing time by 40% for virtualization backup and recovery solutions, fully integrated with Jenkins CI/CD pipelines.",
      "Automated the verification of auto-scaling functionality for Azure and AWS (EC2), executing performance and load testing using JMeter to ensure efficient resource usage and optimal scaling.",
      "Built AutoCenter, a Java and JavaScript-based web application managing 5000+ test cases, significantly improving test scheduling, reporting, and real-time monitoring.",
      "Implemented Infrastructure as Code (IaC) using Terraform and Ansible for automating virtual machine and cloud resource management on Azure and AWS, reducing manual intervention by 60% and enhancing cost efficiency.",
      "Served as a Subject Matter Expert (SME) for Microsoft Hyper-V and Azure solutions, resolving 30+ critical issues and conducting POC sessions that improved system reliability and customer satisfaction.",
      "Mentored interns on test automation methodologies and best practices, fostering improved productivity and technical proficiency within the team."
    ]
  },
  {
    "title": "Associate Software Engineer",
    "company": "Commvault Systems",
    "from": "Jan 2020",
    "to": "Dec 2020",
    "location": "Bengaluru, India",
    "summary": "Designed and implemented a hybrid testing framework combining Selenium UI tests with SDK-based validations, increasing test coverage and reducing redundancy. Optimized Azure cloud resource utilization and reduced costs by 60% through automation scripts and PowerShell tools for monitoring and reporting.",
    "skills": [
      "Java",
      "Python",
      "Selenium",
      "Azure",
      "RestAssured",
      "PowerShell",
      "REST API"
    ],
    "jobDescription": [
      "Designed and implemented a hybrid testing framework combining Selenium UI tests with SDK-based validations, improving test coverage and reducing code duplication across 600+ automated test cases.",
      "Optimized Azure cloud resource utilization, achieving a 60% cost reduction by automating resource management with PowerShell and Java-based scripts, improving resource monitoring, alerting, and report consolidation.",
      "Developed and maintained a REST API test automation framework using RestAssured and TestNG, seamlessly integrating it into CI/CD pipelines to ensure robust backend testing and smooth deployment processes."
    ]
  }
]
